        open input alvara-esp
        if ws-status <> '00'
           move spaces to w-e
           string 'alvara-esp ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input arqcusto
        if ws-status <> '00'
           move spaces to w-e
           string 'arqcusto ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input arq-fant
        if ws-status <> '00'
           move spaces to w-e
           string 'arq-fant ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input arqhorta
        if ws-status <> '00'
           move spaces to w-e
           string 'arqhorta ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input arqmsgn
        if ws-status <> '00'
           move spaces to w-e
           string 'arqmsgn ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input arqpesq
        if ws-status <> '00'
           move spaces to w-e
           string 'arqpesq ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input arqsap
        if ws-status <> '00'
           move spaces to w-e
           string 'arqsap ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input balance
        if ws-status <> '00'
           move spaces to w-e
           string 'balance ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input banco
        if ws-status <> '00'
           move spaces to w-e
           string 'banco ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input bloqm001
        if ws-status <> '00'
           move spaces to w-e
           string 'bloqm001 ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input blqgrupo
        if ws-status <> '00'
           move spaces to w-e
           string 'blqgrupo ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input blqprod
        if ws-status <> '00'
           move spaces to w-e
           string 'blqprod ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input blqzona
        if ws-status <> '00'
           move spaces to w-e
           string 'blqzona ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input boavi
        if ws-status <> '00'
           move spaces to w-e
           string 'boavi ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input bo
        if ws-status <> '00'
           move spaces to w-e
           string 'bo ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input cadbanco
        if ws-status <> '00'
           move spaces to w-e
           string 'cadbanco ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input cadcaixa
        if ws-status <> '00'
           move spaces to w-e
           string 'cadcaixa ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input caddocas
        if ws-status <> '00'
           move spaces to w-e
           string 'caddocas ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input cadfunci
        if ws-status <> '00'
           move spaces to w-e
           string 'cadfunci ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input cadgen2
        if ws-status <> '00'
           move spaces to w-e
           string 'cadgen2 ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input cadgen
        if ws-status <> '00'
           move spaces to w-e
           string 'cadgen ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input cadprodol
        if ws-status <> '00'
           move spaces to w-e
           string 'cadprodol ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input cadresid
        if ws-status <> '00'
           move spaces to w-e
           string 'cadresid ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input cadstk281
        if ws-status <> '00'
           move spaces to w-e
           string 'cadstk281 ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input cadusuarios
        if ws-status <> '00'
           move spaces to w-e
           string 'cadusuarios ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input cadvar
        if ws-status <> '00'
           move spaces to w-e
           string 'cadvar ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input categ-grp
        if ws-status <> '00'
           move spaces to w-e
           string 'categ-grp ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input categoria
        if ws-status <> '00'
           move spaces to w-e
           string 'categoria ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input cdaltlot
        if ws-status <> '00'
           move spaces to w-e
           string 'cdaltlot ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input cdclired
        if ws-status <> '00'
           move spaces to w-e
           string 'cdclired ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input chavenfe
        if ws-status <> '00'
           move spaces to w-e
           string 'chavenfe ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input chendlin
        if ws-status <> '00'
           move spaces to w-e
           string 'chendlin ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input cidadeUF
        if ws-status <> '00'
           move spaces to w-e
           string 'cidadeUF ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input classif
        if ws-status <> '00'
           move spaces to w-e
           string 'classif ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input clicaixa
        if ws-status <> '00'
           move spaces to w-e
           string 'clicaixa ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input clidpara
        if ws-status <> '00'
           move spaces to w-e
           string 'clidpara ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input clienteclf
        if ws-status <> '00'
           move spaces to w-e
           string 'clienteclf ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input condfaixa
        if ws-status <> '00'
           move spaces to w-e
           string 'condfaixa ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input condgrade
        if ws-status <> '00'
           move spaces to w-e
           string 'condgrade ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input condtpcli
        if ws-status <> '00'
           move spaces to w-e
           string 'condtpcli ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input condvdpar
        if ws-status <> '00'
           move spaces to w-e
           string 'condvdpar ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input confclie
        if ws-status <> '00'
           move spaces to w-e
           string 'confclie ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input confclired
        if ws-status <> '00'
           move spaces to w-e
           string 'confclired ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input confende
        if ws-status <> '00'
           move spaces to w-e
           string 'confende ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input confends
        if ws-status <> '00'
           move spaces to w-e
           string 'confends ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input confinteli
        if ws-status <> '00'
           move spaces to w-e
           string 'confinteli ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input confprod
        if ws-status <> '00'
           move spaces to w-e
           string 'confprod ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input confrota
        if ws-status <> '00'
           move spaces to w-e
           string 'confrota ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input confZero
        if ws-status <> '00'
           move spaces to w-e
           string 'confZero ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input contacor
        if ws-status <> '00'
           move spaces to w-e
           string 'contacor ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input contrcarro
        if ws-status <> '00'
           move spaces to w-e
           string 'contrcarro ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input cubetas
        if ws-status <> '00'
           move spaces to w-e
           string 'cubetas ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input descnf
        if ws-status <> '00'
           move spaces to w-e
           string 'descnf ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input difbbs
        if ws-status <> '00'
           move spaces to w-e
           string 'difbbs ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input dschiscancel
        if ws-status <> '00'
           move spaces to w-e
           string 'dschiscancel ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input eanmult
        if ws-status <> '00'
           move spaces to w-e
           string 'eanmult ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input endentrg
        if ws-status <> '00'
           move spaces to w-e
           string 'endentrg ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input etiqprofor
        if ws-status <> '00'
           move spaces to w-e
           string 'etiqprofor ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input excecao
        if ws-status <> '00'
           move spaces to w-e
           string 'excecao ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input excmsgn
        if ws-status <> '00'
           move spaces to w-e
           string 'excmsgn ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input excresid
        if ws-status <> '00'
           move spaces to w-e
           string 'excresid ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input excvalid
        if ws-status <> '00'
           move spaces to w-e
           string 'excvalid ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input fastrack
        if ws-status <> '00'
           move spaces to w-e
           string 'fastrack ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input fat-fer
        if ws-status <> '00'
           move spaces to w-e
           string 'fat-fer ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input geogrpar
        if ws-status <> '00'
           move spaces to w-e
           string 'geogrpar ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input grupofor
        if ws-status <> '00'
           move spaces to w-e
           string 'grupofor ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input grupotv
        if ws-status <> '00'
           move spaces to w-e
           string 'grupotv ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input hiscanal
        if ws-status <> '00'
           move spaces to w-e
           string 'hiscanal ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input hisprotdev
        if ws-status <> '00'
           move spaces to w-e
           string 'hisprotdev ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input ictlnumg
        if ws-status <> '00'
           move spaces to w-e
           string 'ictlnumg ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input idocped
        if ws-status <> '00'
           move spaces to w-e
           string 'idocped ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input intsap
        if ws-status <> '00'
           move spaces to w-e
           string 'intsap ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input invnumcon
        if ws-status <> '00'
           move spaces to w-e
           string 'invnumcon ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input linhinvp
        if ws-status <> '00'
           move spaces to w-e
           string 'linhinvp ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input lotevezn
        if ws-status <> '00'
           move spaces to w-e
           string 'lotevezn ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input matricul
        if ws-status <> '00'
           move spaces to w-e
           string 'matricul ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input metaprio
        if ws-status <> '00'
           move spaces to w-e
           string 'metaprio ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input modfec
        if ws-status <> '00'
           move spaces to w-e
           string 'modfec ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input motcanmin
        if ws-status <> '00'
           move spaces to w-e
           string 'motcanmin ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input nfentrada
        if ws-status <> '00'
           move spaces to w-e
           string 'nfentrada ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input nomefant
        if ws-status <> '00'
           move spaces to w-e
           string 'nomefant ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input notapt
        if ws-status <> '00'
           move spaces to w-e
           string 'notapt ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input notlot
        if ws-status <> '00'
           move spaces to w-e
           string 'notlot ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input numpedol
        if ws-status <> '00'
           move spaces to w-e
           string 'numpedol ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input olcodcli
        if ws-status <> '00'
           move spaces to w-e
           string 'olcodcli ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input olprojeto
        if ws-status <> '00'
           move spaces to w-e
           string 'olprojeto ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input olprovedor
        if ws-status <> '00'
           move spaces to w-e
           string 'olprovedor ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input operadora
        if ws-status <> '00'
           move spaces to w-e
           string 'operadora ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input paleprod
        if ws-status <> '00'
           move spaces to w-e
           string 'paleprod ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input pdf1
        if ws-status <> '00'
           move spaces to w-e
           string 'pdf1 ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input pednfsap
        if ws-status <> '00'
           move spaces to w-e
           string 'pednfsap ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input peem
        if ws-status <> '00'
           move spaces to w-e
           string 'peem ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input pfc11
        if ws-status <> '00'
           move spaces to w-e
           string 'pfc11 ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input pfc12c
        if ws-status <> '00'
           move spaces to w-e
           string 'pfc12c ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input pfc2
        if ws-status <> '00'
           move spaces to w-e
           string 'pfc2 ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input pfc2s1
        if ws-status <> '00'
           move spaces to w-e
           string 'pfc2s1 ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input pfc3a
        if ws-status <> '00'
           move spaces to w-e
           string 'pfc3a ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input pfc3
        if ws-status <> '00'
           move spaces to w-e
           string 'pfc3 ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input pfc3sap
        if ws-status <> '00'
           move spaces to w-e
           string 'pfc3sap ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input pfc4g
        if ws-status <> '00'
           move spaces to w-e
           string 'pfc4g ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input pfc4
        if ws-status <> '00'
           move spaces to w-e
           string 'pfc4 ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input pfc4rep
        if ws-status <> '00'
           move spaces to w-e
           string 'pfc4rep ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input pfc4s
        if ws-status <> '00'
           move spaces to w-e
           string 'pfc4s ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input pfc5
        if ws-status <> '00'
           move spaces to w-e
           string 'pfc5 ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input pfc7
        if ws-status <> '00'
           move spaces to w-e
           string 'pfc7 ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input pfd4n
        if ws-status <> '00'
           move spaces to w-e
           string 'pfd4n ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input pffecham
        if ws-status <> '00'
           move spaces to w-e
           string 'pffecham ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input pfm15
        if ws-status <> '00'
           move spaces to w-e
           string 'pfm15 ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input placaiti
        if ws-status <> '00'
           move spaces to w-e
           string 'placaiti ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input planilha01
        if ws-status <> '00'
           move spaces to w-e
           string 'planilha01 ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input planilha02
        if ws-status <> '00'
           move spaces to w-e
           string 'planilha02 ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input planilha03
        if ws-status <> '00'
           move spaces to w-e
           string 'planilha03 ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input planilha03u
        if ws-status <> '00'
           move spaces to w-e
           string 'planilha03u ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input planilha05
        if ws-status <> '00'
           move spaces to w-e
           string 'planilha05 ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input planilha05u
        if ws-status <> '00'
           move spaces to w-e
           string 'planilha05u ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input planilha06d
        if ws-status <> '00'
           move spaces to w-e
           string 'planilha06d ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input planilha06h
        if ws-status <> '00'
           move spaces to w-e
           string 'planilha06h ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input planilha06l
        if ws-status <> '00'
           move spaces to w-e
           string 'planilha06l ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input planilha13
        if ws-status <> '00'
           move spaces to w-e
           string 'planilha13 ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input planilha15
        if ws-status <> '00'
           move spaces to w-e
           string 'planilha15 ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input planlib
        if ws-status <> '00'
           move spaces to w-e
           string 'planlib ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input planvol
        if ws-status <> '00'
           move spaces to w-e
           string 'planvol ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input plunifica01
        if ws-status <> '00'
           move spaces to w-e
           string 'plunifica01 ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input prodclas
        if ws-status <> '00'
           move spaces to w-e
           string 'prodclas ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input prodestB
        if ws-status <> '00'
           move spaces to w-e
           string 'prodestB ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input produtZ5
        if ws-status <> '00'
           move spaces to w-e
           string 'produtZ5 ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input programas
        if ws-status <> '00'
           move spaces to w-e
           string 'programas ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input progs
        if ws-status <> '00'
           move spaces to w-e
           string 'progs ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input protodev
        if ws-status <> '00'
           move spaces to w-e
           string 'protodev ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input qtdpedcli
        if ws-status <> '00'
           move spaces to w-e
           string 'qtdpedcli ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input regcaixa
        if ws-status <> '00'
           move spaces to w-e
           string 'regcaixa ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input relacmsg
        if ws-status <> '00'
           move spaces to w-e
           string 'relacmsg ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input retencao
        if ws-status <> '00'
           move spaces to w-e
           string 'retencao ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input rotastp
        if ws-status <> '00'
           move spaces to w-e
           string 'rotastp ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input rotastr
        if ws-status <> '00'
           move spaces to w-e
           string 'rotastr ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input saldopend
        if ws-status <> '00'
           move spaces to w-e
           string 'saldopend ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input saldwmsz
        if ws-status <> '00'
           move spaces to w-e
           string 'saldwmsz ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input scfuncao
        if ws-status <> '00'
           move spaces to w-e
           string 'scfuncao ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input scsconfg
        if ws-status <> '00'
           move spaces to w-e
           string 'scsconfg ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input scscxcli
        if ws-status <> '00'
           move spaces to w-e
           string 'scscxcli ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input scscxemb
        if ws-status <> '00'
           move spaces to w-e
           string 'scscxemb ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input scsfunci
        if ws-status <> '00'
           move spaces to w-e
           string 'scsfunci ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input scsfunst
        if ws-status <> '00'
           move spaces to w-e
           string 'scsfunst ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input scslbset
        if ws-status <> '00'
           move spaces to w-e
           string 'scslbset ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input subsetor
        if ws-status <> '00'
           move spaces to w-e
           string 'subsetor ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input supcard00c
        if ws-status <> '00'
           move spaces to w-e
           string 'supcard00c ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input supcard04c
        if ws-status <> '00'
           move spaces to w-e
           string 'supcard04c ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input supcard11
        if ws-status <> '00'
           move spaces to w-e
           string 'supcard11 ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input tabaltusu
        if ws-status <> '00'
           move spaces to w-e
           string 'tabaltusu ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input tabelmsg
        if ws-status <> '00'
           move spaces to w-e
           string 'tabelmsg ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input tabimpsetor
        if ws-status <> '00'
           move spaces to w-e
           string 'tabimpsetor ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input tabreimp
        if ws-status <> '00'
           move spaces to w-e
           string 'tabreimp ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input tipocli
        if ws-status <> '00'
           move spaces to w-e
           string 'tipocli ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input usuarios
        if ws-status <> '00'
           move spaces to w-e
           string 'usuarios ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input vendas
        if ws-status <> '00'
           move spaces to w-e
           string 'vendas ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input vndativo
        if ws-status <> '00'
           move spaces to w-e
           string 'vndativo ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input xcdev01
        if ws-status <> '00'
           move spaces to w-e
           string 'xcdev01 ' ws-status into w-e
           write txt-reg from w-e
        end-if 
        open input xcdev02
        if ws-status <> '00'
           move spaces to w-e
           string 'xcdev02 ' ws-status into w-e
           write txt-reg from w-e
        end-if 
